tap 'caskroom/cask'

cask 'appcleaner' 
cask 'vivaldi' 
cask 'iterm2'
cask 'copyq'

cask 'visual-studio-code' 
brew 'neovim' 


brew 'zsh'
brew 'git' 
brew 'tree' 
brew 'rmtrash' 
brew 'fzf' 
brew 'the_silver_searcher' 

cask 'alfred'

brew 'chunkwm' 
cask 'karabiner-elements' 

cask 'docker' 

