tap 'homebrew/cask'

cask 'appcleaner' 
cask 'iterm2'
cask 'copyq'
cask 'google-japanese-ime'

cask 'visual-studio-code' 
brew 'neovim' 

brew 'zsh'
brew 'git' 
brew 'tree' 
brew 'rmtrash' 
brew 'colordiff' 
brew 'ranger' 
brew 'fzy' 
brew 'autojump' 
brew 'the_silver_searcher' 
brew 'gnu-sed'
brew 'fd'

brew 'tmux' 
brew 'reattach-to-user-namespace' 

tap 'koekeishiya/formulae'
brew 'yabai' 

cask 'docker' 
