tap 'caskroom/cask'

cask 'appcleaner' 
cask 'vivaldi' 
cask 'iterm2'
cask 'copyq'
cask 'google-japanese-ime'

cask 'visual-studio-code' 
brew 'neovim' 

brew 'fish'
brew 'git' 
brew 'tree' 
brew 'trash-cli' 
brew 'colordiff' 
brew 'ranger' 
brew 'tmux' 
brew 'fzy' 
brew 'autojump' 
brew 'the_silver_searcher' 

cask 'alfred'

tap 'koekeishiya/formulae'
brew 'chunkwm' 
cask 'karabiner-elements' 

cask 'docker' 

cask 'mackup' 

